# SetRed Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency..::..SetRed Method
ColorWithTransparency Class See Also
---
set red
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetRed(
	uint red
)
```

Visual Basic
---
```text
Public Sub SetRed ( _
	red As UInteger _
)
```

Visual C++
---
```text
public:
void SetRed(
	unsigned int red
)
```

# ### Parameters
red
    Type: System..::..UInt32 red
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

# See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace